app/channels/games_channel.rb

  def subscribed
    room = Room.find(params[:id])
---
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 194], ["LIMIT", 1]]