app/controllers/rooms_controller.rb

    def index
        headers['Access-Control-Allow-Origin'] = '*'

        rooms = Room.all
---
SELECT "rooms".* FROM "rooms"

    def show
        headers['Access-Control-Allow-Origin'] = '*'

        room = Room.find params[:id]
---
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 326], ["LIMIT", 1]]

    def create
        headers['Access-Control-Allow-Origin'] = '*'

        room = Room.new host_id: current_user.id
        p "*************************", room
        if room.save
---
INSERT INTO "rooms" ("created_at", "updated_at", "host_id") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2022-02-24 14:42:51.919262"], ["updated_at", "2022-02-24 14:42:51.919262"], ["host_id", 37]]

    def update
        headers['Access-Control-Allow-Origin'] = '*'
        room = Room.find params[:id]
---
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 327], ["LIMIT", 1]]

    def start
        room = Room.find params[:id]
        random_user = room.users.sample(1)
        room.imposter_id = random_user[0].id
        room.game_status = true
        room.save
---
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 327], ["LIMIT", 1]]
UPDATE "rooms" SET "imposter_id" = $1, "game_status" = $2, "updated_at" = $3 WHERE "rooms"."id" = $4  [["imposter_id", 38], ["game_status", true], ["updated_at", "2022-02-24 14:43:12.419171"], ["id", 327]]

    def destroy
        room = Room.destroy params[:id]
---
DELETE FROM "rooms" WHERE "rooms"."id" = $1  [["id", 326]]